# Before you start :
   - These exercises are related to the Pivot table and correlation lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in the `your-code` folder of this lab.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary.

In [1]:
# your answer here
import pandas as pd
import numpy as np

#### Open the ` Employee.csv` file and name your dataset `employee`.

In [2]:
# your answer here
employee = pd.read_csv('/Users/Hector_Martin/Documents/Labs/lab-pivot-table-and-correlation/your_code/data/Employee.csv')
fitbit = pd.read_csv('/Users/Hector_Martin/Documents/Labs/lab-pivot-table-and-correlation/your_code/data/Fitbit.csv')
timegrades = pd.read_csv('/Users/Hector_Martin/Documents/Labs/lab-pivot-table-and-correlation/your_code/data/Time_Grades.csv')

display(employee.head())

#It seems that he other 2 dataframes are not meant to be used here
display(fitbit.head())
display(timegrades.head())

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55

,Date,Calorie burned,Steps,Distance,Floors,Minutes Sedentary,Minutes Lightly Active,Minutes Fairly Active,Minutes Very Active,Activity Calories,MinutesOfSleep,MinutesOfBeingAwake,NumberOfAwakings,LengthOfRestInMinutes
0,08-05-2015,1934,905,0.65,0,1.355,46,0,0,1680,384,26,23,417
1,09-05-2015,3631,18925,14.11,4,611.000,316,61,60,2248,454,35,21,491
2,10-05-2015,3204,14228,10.57,1,602.000,226,14,77,1719,387,46,25,436
3,11-05-2015,2673,6756,5.02,8,749.000,190,23,4,9620,311,31,21,350
4,12-05-2015,2495,502,3.73,1,876.000,171,0,0,7360,407,65,44,491

     Name  Study time  Grade
0    Jose           4      4
1   Maria           9      7
2   David           8      9
3   Sonia          10      7
4  Samuel          20      9

#### What's the mean salary by department?
Hint : There are 2 ways to do it - one way is with groupby and the other way is with pivot tables. Do it both ways.

In [3]:
# Method 1
# your answer here

#Pivot Table:
display(employee.pivot_table(index=['Department'], values = ['Salary'], aggfunc = ['mean']))

#Group by:
display(employee.groupby(['Department'])[['Salary']].agg(np.mean))

             mean
           Salary
Department
HR          45.00
IT          48.75
Sales       55.00

            Salary
Department
HR           45.00
IT           48.75
Sales        55.00

#### We want now to group the data by more than one column. Use Pandas pivot table function to select the mean salary by department and title.

In [4]:
# your answer here

#Pivot Table:

display(employee.pivot_table(index=['Department', 'Title'], values = ['Salary'], aggfunc = ['mean']))

                       mean
                     Salary
Department Title
HR         VP          70.0
           analyst     32.5
IT         VP          70.0
           analyst     32.5
           associate   60.0
Sales      associate   55.0

In [5]:
# your answer here

#Group by:
display(employee.groupby(['Department', 'Title'])[['Salary']].agg(np.mean))

                      Salary
Department Title
HR         VP           70.0
           analyst      32.5
IT         VP           70.0
           analyst      32.5
           associate    60.0
Sales      associate    55.0

#### We want to display the number of years of work experience and the salary for each Title. Add Years as a column in your pivot table.
*Hint: Use Pandas doc(see References in README.md) to explore the pivot_table() arguments*

In [6]:
# your answer here

#Don't know if they are asking exactly like that. If it is not this, please, let me know. I wrote 2 pieces of code:

display(employee.pivot_table(index=['Title'], values = ['Years','Salary']))

#OR

display(employee.pivot_table(index=['Title'], values = ['Years','Salary'], aggfunc = ['mean']))

              Salary  Years
Title
VP         70.000000   8.00
analyst    32.500000   2.25
associate  56.666667   4.00

                mean
              Salary Years
Title
VP         70.000000  8.00
analyst    32.500000  2.25
associate  56.666667  4.00

#### We want to know the information about the mean salary and number of employees in each department and for each job title.

In [7]:
# your answer here

display(employee.pivot_table(index=['Department','Title'], values = ['Salary', 'Name'], aggfunc = {'Salary':'mean','Name':'count'}))

                      Name  Salary
Department Title
HR         VP            1    70.0
           analyst       2    32.5
IT         VP            1    70.0
           analyst       2    32.5
           associate     1    60.0
Sales      associate     2    55.0

#### We want to know for each department and for each job title the Salary's median, minimum, maximum and standard deviation. Comment your results.

In [8]:
# your answer here
agg_emp = employee.pivot_table(index=['Department','Title'], values = ['Salary'], aggfunc = [np.median, np.min, np.max, np.std]).reset_index()

display(agg_emp)
display(agg_emp.shape)
display(agg_emp.isna().sum())
display(agg_emp.columns)

  Department      Title median   amin   amax       std
                        Salary Salary Salary    Salary
0         HR         VP   70.0     70     70       NaN
1         HR    analyst   32.5     30     35  3.535534
2         IT         VP   70.0     70     70       NaN
3         IT    analyst   32.5     30     35  3.535534
4         IT  associate   60.0     60     60       NaN
5      Sales  associate   55.0     55     55  0.000000

(6, 6)

Department            0
Title                 0
median      Salary    0
amin        Salary    0
amax        Salary    0
std         Salary    3
dtype: int64

MultiIndex([('Department',       ''),
            (     'Title',       ''),
            (    'median', 'Salary'),
            (      'amin', 'Salary'),
            (      'amax', 'Salary'),
            (       'std', 'Salary')],
           )

#### Based on your comments, fill the missing values with an appropriate value.

In [9]:
# your answer here

# I hope this is the right way, navigating within multiindex tables is a nightmare :)
display(agg_emp.fillna(np.std(agg_emp['std','Salary'])))

display(agg_emp.fillna(np.std(agg_emp[{'std':'Salary'}])))

  Department      Title median   amin   amax       std
                        Salary Salary Salary    Salary
0         HR         VP   70.0     70     70  1.666667
1         HR    analyst   32.5     30     35  3.535534
2         IT         VP   70.0     70     70  1.666667
3         IT    analyst   32.5     30     35  3.535534
4         IT  associate   60.0     60     60  1.666667
5      Sales  associate   55.0     55     55  0.000000

  Department      Title median   amin   amax       std
                        Salary Salary Salary    Salary
0         HR         VP   70.0     70     70  1.666667
1         HR    analyst   32.5     30     35  3.535534
2         IT         VP   70.0     70     70  1.666667
3         IT    analyst   32.5     30     35  3.535534
4         IT  associate   60.0     60     60  1.666667
5      Sales  associate   55.0     55     55  0.000000

In [10]:
#this is just to try how to navigate within multiindex Dataframes, it seems that I got it.
agg_emp[{'median':'Salary', 'amax':'Salary' }]

  median   amax
  Salary Salary
0   70.0     70
1   32.5     35
2   70.0     70
3   32.5     35
4   60.0     60
5   55.0     55

#### The stakeholders want to know for each department the number of employees and how much money is spend on salaries. Could you provide that information?

In [11]:
# your answer here

employee.pivot_table(index=['Department'], values = ['Name', 'Salary'], aggfunc = {'Salary':'sum','Name':'count'})

            Name  Salary
Department
HR             3     135
IT             4     195
Sales          2     110

#### For each Department and Title, we want to know the the total years of work experience and the mean salary.

In [12]:
employee.head()

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55

In [13]:
# your answer here

employee.pivot_table(index=['Department', 'Title'], values = ['Years', 'Salary'], aggfunc = {'Years':'sum','Salary':'mean'}).reset_index()

  Department      Title  Salary  Years
0         HR         VP    70.0      8
1         HR    analyst    32.5      6
2         IT         VP    70.0      8
3         IT    analyst    32.5      3
4         IT  associate    60.0      7
5      Sales  associate    55.0      5

### Bonus

#### We now want to compute the mean salary after removing the maxima for each Department. Create the appropriate pivot table.

Hint: Write a custom function.

In [14]:
employee.pivot_table(index=['Department'], values = ['Salary'], aggfunc = {'Salary': np.max}).reset_index()
employee.pivot_table(index=['Department'], values = ['Salary'], aggfunc = {'Salary':'mean'}).reset_index()

  Department  Salary
0         HR   45.00
1         IT   48.75
2      Sales   55.00

In [16]:
employee.head()

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55

In [56]:
cols = []
for i in emp_agg['Salary']:
    cols.append(i)

print(cols)

[70, 70, 55]

In [64]:
# your answer here

def meanaftermax(df, cols):
    df2 = df.copy()
    #max_salary = {'HR': 0,'IT': 0,'Sales': 0}
    #df_agg = df2.pivot_table(index=['Department'], values = ['Salary'], aggfunc = {'Salary': np.max}).reset_index()

    #for department in max_salary.keys():      
    #    max_salary[department] = df_agg.iloc[df_agg[df_agg['Department'] == department].index,1]
    
    
    #for department in max_salary.keys():
    #    rows_dep = df2[df2['Department'] == department].index
        
    #    print("Target department is: ",department)
    #    display( df2.iloc[rows_dep,6].values )
        #display(df2[ ( df2[df2['Department'] == department] ) & ( df2['Salary'] != max_salary[department] ) ] )
        #display(( df2[(df2.iloc[rows_dep,1] != max_salary[department]) | (df2['Department'] != department) ])
        #df2 = df2[(df2.iloc[rows_dep,1] != max_salary[department]) | (df2['Department'] != department) ]

        
    return df2[~df2['Salary'].isin(cols)]
    #df2 = df2.pivot_table(index=['Department'], values = ['Salary'], aggfunc = {'Salary': np.mean}).reset_index()
    
    #return df2

meanaftermax(employee, cols)

  Department     Salary
0         HR  32.500000
1         IT  41.666667

In [ ]:
# your answer here

def meanaftermax(df, cols):
    df2 = df.copy()
    df2 = df2[~df2['Salary'].isin(list(cols))]
    df2 = df2.pivot_table(index=['Department'], values = ['Salary'], aggfunc = {'Salary': np.mean}).reset_index()
    return df2

meanaftermax(employee, cols)